presentations/intro-to/the-unix-commandline.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>The Unix Commandline</title>
<meta name="author" content="Jeetaditya Chatterjee"/>
<link rel="stylesheet" href="../reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="../reveal.js/dist/theme/black.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>The Unix Commandline</h1><h3></h3><h2>By  Jeetaditya Chatterjee</h2><h3><i>Your inner hacker will be released today</i></h3><p>Press s for speaker notes</p>
</section>

<section>
<section id="slide-orga223b31">
<h2 id="orga223b31">What is the Unix commandline?</h2>
<aside class="notes">
<p>
The unix commandline is an interpreter known as the shell and a set of tools that come together to
form a functional operating system. Not only do you call a command but you can
chain them to form larger and more complex programs from simple building blocks
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org6c73c55">
<h2 id="org6c73c55">Why do I need to know the Unix command line?</h2>
<aside class="notes">
<p>
It is a good skill to have for many reasons
</p>
<ul>
<li>Linux is the biggest and largest form of Unix like OS used today and its used
on most servers. If you ever need to ssh into a server to fix something and
you don&rsquo;t know the basics then you will be F*ucked</li>
<li>The commandline unlike in windows is much more direct and powerful. This means
that a lot of guides in linux land will use it over a gui tool you may be used to
<ul>
<li>chaining commands together feels a lot more satisfying than <i>python</i></li>

</ul></li>

</ul>

</aside>

</section>
</section>
<section>
<section id="slide-org3227d26">
<h2 id="org3227d26">What do I need too know then?</h2>
<div class="outline-text-2" id="text-org3227d26">
</div>
</section>
<section id="slide-org342b7cd">
<h3 id="org342b7cd">A little bit of syntax</h3>
<div class="outline-text-3" id="text-org342b7cd">
</div>
</section>
<section id="slide-org7ffff83">
<h4 id="org7ffff83">Variables</h4>
<aside class="notes">
<p>
Shell is not a very nice language so syntax is important
To set a variable you would set it like any other language but you can&rsquo;t have a
space between the variable symbol and the equals sign
</p>

<p>
To call it you need to prepend the $ sign
</p>

<p>
Environment variables are global variables to set them you need to prepend export
</p>

</aside>
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #e95678;">var</span>=<span style="color: #fab795;">"some value"</span>
<span style="color: #b877db;">export</span> <span style="color: #e95678;">ENVAR</span>=<span style="color: #fab795;">"some global value"</span>
<span style="color: #21bfc2;">echo</span> $<span style="color: #e95678;">VAR</span>
<span style="color: #21bfc2;">echo</span> $<span style="color: #e95678;">ENVAR</span>
</pre>
</div>
</section>
<section id="slide-orgc1a2b70">
<h4 id="orgc1a2b70">flags</h4>
<aside class="notes">
<p>
A flag is an optional argument provided to a command to provide it with some
sort of structured input or to tell it to do something they are usually denoted
with a - hyphen and a single letter or 2 hyphens and a word you can usually
string together multiple short form commands
</p>

</aside>

<div class="org-src-container">

<pre class="src src-shell">command -l <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">short form flags</span>
command -la <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">2 short form flags</span>
command --long <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">long form flags</span>
command --input INPUT <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">example of input</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org613ccbb">
<h2 id="org613ccbb">The main commands</h2>
<div class="outline-text-2" id="text-org613ccbb">
</div>
</section>
<section id="slide-org571f26d">
<h3 id="org571f26d">Moving around</h3>
<div class="outline-text-3" id="text-org571f26d">
</div>
</section>
<section id="slide-org1187238">
<h4 id="org1187238">pwd</h4>
<p>
Prints the current directory
</p>
<aside class="notes">
<p>
pwd prints the current working directory
It stands for print working directory
</p>

</aside>
<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">pwd</span>
</pre>
</div>
</section>
<section id="slide-orgc7adeb3">
<h4 id="orgc7adeb3">cd</h4>
<p>
change directory
</p>
<aside class="notes">
<p>
Change the current directory
</p>

<p>
Some sybols that are helpful
~ which is a shortcut to your home dir
. is the current directory
.. is the previous directory
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">cd</span> ~/your/directory
$ <span style="color: #21bfc2;">pwd</span>
/home/$<span style="color: #e95678;">USER</span>/your/directory
$ <span style="color: #21bfc2;">cd</span> ~ <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">cd</span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;"> /home/$USER</span>
$ <span style="color: #21bfc2;">pwd</span>
/home/jeet
$ <span style="color: #21bfc2;">cd</span> ..
$ <span style="color: #21bfc2;">pwd</span>
/home
</pre>
</div>

</section>
<section id="slide-org1f19a23">
<h4 id="org1f19a23">ls</h4>
<p>
list the current directory&rsquo;s contents
</p>
<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">ls</span>
$ <span style="color: #21bfc2;">ls</span> -a
$ <span style="color: #21bfc2;">ls</span> -l
$ <span style="color: #21bfc2;">ls</span> -la
</pre>
</div>

<aside class="notes">
<p>
The ls command lists the current directory
the -a flag will show hidden files (all files)
these are denoted with a dot infront of there name
the -l flag will list all files in the long format
</p>

</aside>
</section>
<section id="slide-org76e8daf">
<h3 id="org76e8daf">Files</h3>
<div class="outline-text-3" id="text-org76e8daf">
</div>
</section>
<section id="slide-org421ee95">
<h4 id="org421ee95">touch</h4>
<aside class="notes">
<p>
touch is used to create an empty file. Its actually used to change the time
stamp on the file but thats not used as much. if at all
</p>

<p>
you have to provide the date in the disgusting order of month day year
</p>

</aside>

<div class="org-src-container">

<pre class="src src-shell">$ <span style="color: #21bfc2;">touch</span> file

$ <span style="color: #21bfc2;">touch</span> existing-file -d month/day/year
</pre>
</div>

</section>
<section id="slide-org371ee68">
<h4 id="org371ee68">mv</h4>
<aside class="notes">
<p>
mv is used to move files around the filesystem. It takes the file to move and
the destination of that file. It is also used to rename a file
</p>

<p>
If you need to move directorys then you need to make sure that the names are
unique. mv will not move that file by default but if you provide the -f then you
will overwrite the previous directory
There also the -i flag that will ask you to confirm
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">mv</span> SOURCE DESTINATION

$ <span style="color: #21bfc2;">ls</span>
file1
$ <span style="color: #21bfc2;">mv</span> file1 file2
$ <span style="color: #21bfc2;">ls</span>
file2

$ <span style="color: #21bfc2;">ls</span>
dir1 dir2
$ <span style="color: #21bfc2;">mv</span> dir1 dir2
mv: cannot move <span style="color: #fab795;">'dir1'</span> ro <span style="color: #fab795;">'dir2'</span> : Directory not empy
$ <span style="color: #21bfc2;">mv</span> dir1 dir2 -f
$ <span style="color: #21bfc2;">ls</span>
dir2
</pre>
</div>
</section>
<section id="slide-orgcb706b2">
<h4 id="orgcb706b2">cp</h4>
<aside class="notes">
<p>
cp copys a file leaving the source file intact It can overwite the destination
file tho so be careful with your names you can use the -f and -i flag like you
would for mv
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">cp</span> SOURCE DEST

$ <span style="color: #21bfc2;">ls</span>
file1
$ <span style="color: #21bfc2;">cp</span> file1 file2
$ <span style="color: #21bfc2;">ls</span>
file1 file2
</pre>
</div>
</section>
<section id="slide-org0f67e35">
<h4 id="org0f67e35">ln</h4>
<aside class="notes">
<p>
ln creates a symbolic link between two files. a symbolic link is reference to
another file it does not actually copy the file and is very useful for a lot of
different senarios. some being storing files spread out over the file system in
a central location.
</p>

<p>
it take the arguments of source and destination and an optional flag -s which
makes the link soft. by default the symbolic link will not look like a link but
another file. if you want it to show up as a link you need to add the -s flag
</p>

</aside>
<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">ln</span> source-file dest-file
$ <span style="color: #21bfc2;">ls</span> -l
-rw-rw-r-- jeet jeet ... source-file
-rw-rw-r-- jeet jeet ... dest-file

$ <span style="color: #21bfc2;">ln</span> source-file dest-file -s
$ <span style="color: #21bfc2;">ls</span> -l
-rw-rw-r-- jeet jeet ... source-file
lrwxrwxrwx jeet jeet ... dest-file -&gt; source-file
</pre>
</div>
</section>
