presentations/intro-to/the-unix-commandline.html
<section id="slide-org5607376">
<h4 id="org5607376">rm</h4>
<aside class="notes">
<p>
delete a file. add the -i flag to ask for your confirmation. If you need to
delete a directory then you need to add the -r (recursive) flag and if the file
cannot be written to then you can use the -f option
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">rm</span> file -i
rm: remove regular file <span style="color: #fab795;">'file'</span>? <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">your input here</span>
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">no more file</span>
$ <span style="color: #21bfc2;">rm</span> dir
rm: cannot remove <span style="color: #fab795;">'dir'</span> : Is a directory
$ <span style="color: #21bfc2;">rm</span> dir -r
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">all good</span>
</pre>
</div>

</section>
<section id="slide-orgfc5fd5e">
<h4 id="orgfc5fd5e">mkdir</h4>
<aside class="notes">
<p>
make a directory.. use the -p flag to make a lot of child directorys quickly
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">mkdir</span> dir

$ <span style="color: #21bfc2;">mkdir</span> dir1/dir2/dir2
mkdir: cannot create directory <span style="color: #fab795;">'dir1/dir2/dir3'</span>: No such file or directory
$ <span style="color: #21bfc2;">mkdir</span> dir1/dir2/dir2 -p
</pre>
</div>
</section>
<section id="slide-org169deb2">
<h3 id="org169deb2">Reading and writing files</h3>
<div class="outline-text-3" id="text-org169deb2">
</div>
</section>
<section id="slide-org9e4b6c4">
<h4 id="org9e4b6c4">cat</h4>
<aside class="notes">
<p>
output and concatenate multiple files.
</p>

</aside>

<div class="org-src-container">

<pre class="src src-shell">$ <span style="color: #21bfc2;">cat</span> file
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">contense of file</span>
$ <span style="color: #21bfc2;">cat</span> file1 file2
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">contense of both files</span>
</pre>
</div>
</section>
<section id="slide-orga8aa524">
<h4 id="orga8aa524">head</h4>
<aside class="notes">
<p>
Output the first 10 lines of a file
the -n flag allows you to specify the amount of lines you want to print out
</p>

</aside>

<div class="org-src-container">

<pre class="src src-shell">$ head file -n <span style="color: #f09383; font-weight: bold;">20</span>
</pre>
</div>
</section>
<section id="slide-org47d6fc6">
<h4 id="org47d6fc6">tail</h4>
<aside class="notes">
<p>
Same as head but for the last 10 lines
again -n will allow you to specify the amount of lines
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ tail file -n <span style="color: #f09383; font-weight: bold;">20</span>
</pre>
</div>
</section>
<section id="slide-orgd175aa1">
<h4 id="orgd175aa1">chmod</h4>
<aside class="notes">
<p>
Change the file permissions. In linux files do not need extensions. instead
attached to each and every file is a set of permissions. You saw them when we
discussed ln. chmod changes those permissions. if you want to add a permission
then do + followed by r w x or remove them replace the + with a minus
</p>

<p>
Notice the different groups. the first symbol is the type it can be d for
directory l for link or - for file
the first set of 3 is what root can do. root is the main user and they have free
reign over the system. the second triple is the user permissions and the last one
is other peoples permissions
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">ls</span> -l
-rw-rw-r-- ... file
$ <span style="color: #21bfc2;">chmod</span> +x file
$ <span style="color: #21bfc2;">ls</span> -l
-rwxrwxr-x ... file

$ <span style="color: #21bfc2;">chmod</span> -rwx file
---------- ... file
</pre>
</div>
</section>
<section id="slide-orga123960">
<h3 id="orga123960">Transforming text</h3>
<div class="outline-text-3" id="text-orga123960">
</div>
</section>
<section id="slide-orga7b965a">
<h4 id="orga7b965a">echo</h4>
<aside class="notes">
<p>
shell print statement. It will print out a string of text. If you use
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash"><span style="color: #21bfc2;">echo</span> <span style="color: #fab795;">"a string"</span>
a string
<span style="color: #21bfc2;">echo</span> -e <span style="color: #fab795;">"this is a \n multiline string "</span>
this is a
 multiline string
<span style="color: #21bfc2;">echo</span> $<span style="color: #e95678;">VAR</span>
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">contense of VAR</span>
</pre>
</div>
</section>
<section id="slide-org75fb638">
<h4 id="org75fb638">grep</h4>
<aside class="notes">
<p>
grep is a commandline regex matcher. It takes the arguments of a string (usually
with a regular expression) and a file.
some useful flags are -v which returns all of the lines that do not match -i
which ignores case and -c which counts the number of occurrences
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">cat</span> file
fox
fax
fex
$ <span style="color: #21bfc2;">grep</span> <span style="color: #fab795;">"fox"</span> file
fox
$ <span style="color: #21bfc2;">grep</span> <span style="color: #fab795;">"f.x"</span> file

$ <span style="color: #21bfc2;">grep</span> <span style="color: #fab795;">"fox"</span> file -v
fax
fex
</pre>
</div>
</section>
<section id="slide-orgec61099">
<h4 id="orgec61099">sed</h4>
<aside class="notes">
<p>
sed is used to make substutions in text it takes the arguments of a command and
a file It has a little bit of a werid syntax so bear with me
</p>

<p>
in the string we start it with s this tells sed we are performing a substitution
we then provide it with a regex this is what will be substituted then you
provide the substitution. There is more syntax here but these are the basics
</p>

<p>
Now by default sed will only perform 1 substitution to tell it to replace all
you need to add g to the end this is called a flag
</p>

<p>
You can add the -i flag to change the file in place. if you add an argument to
it will create a backup of the file you are about to change
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ sed <span style="color: #fab795;">'s/REGEX/REPLACEMENT/FLAG'</span> file

$ <span style="color: #21bfc2;">cat</span> file
the fox did fox things to say fox you to big fox
$ sed <span style="color: #fab795;">'s/fox/wolf/'</span> file
the wolf did fox things to say fox you to big fox

$ sed <span style="color: #fab795;">'s/fox/wolf/g'</span> file
the wolf did wolf things to say wolf you to big wolf

$ sed <span style="color: #fab795;">'s/fox/wolf/g'</span> file -i

$ <span style="color: #21bfc2;">cat</span> file
the wolf did wolf things to say wolf you to big wolf
</pre>
</div>

</section>
<section id="slide-org35978b1">
<h4 id="org35978b1">awk</h4>
<aside class="notes">
<p>
awk is a swiss a text processing swiss army knife. it is its own language and
can pretty much replace all of the text processing commands. Now do I recommend
that? welll probably not. but its pretty cool. Now that being said most people
use awk to get out column&rsquo;s of data.
</p>

<p>
Awk first splits your files into lines and then into fields and then store those
fields in variables. they are denoted by a $ sign and the number of the field
note that $0 holds the whole file and $NF holds the last. If you want the first
field you would call $1 second so on
</p>

<p>
Now this can be useful but it may be more useful for a csv file. To change the
field seperatior you need to use the -F flag
</p>

<p>
In this example we are restructuring a csv to make it into a nicer format
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">cat</span> file
this file is has space seperated words
it has multiple lines

$ awk <span style="color: #fab795;">'{print $0}'</span> file <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">we just made a slower </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">less</span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;"> convenient cat!</span>
this file is has space seperated words
$ awk <span style="color: #fab795;">'{print $1}'</span> file <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;">print the first element of each line</span>
this
it
$ <span style="color: #21bfc2;">cat</span> file.csv
name,age,job
Jeet,18,Being a Nerd

$ awk -F, <span style="color: #fab795;">'{printf("name:%s job:%s age:%s", $1, $3, $2)}'</span> file.csv
name:Jeet job:Being a nerd age:18
</pre>
</div>
</section>
<section id="slide-org8de0265">
<h4 id="org8de0265">sort</h4>
<aside class="notes">
<p>
sort sorts a file. You can tell it to sort using a numeric sort -n a dictionary
sort (whch is also known as alphanumeric) as well as others
</p>

</aside>

<div class="org-src-container">

<pre class="src src-bash">$ <span style="color: #21bfc2;">cat</span> file-o-numbers
<span style="color: #f09383; font-weight: bold;">1</span>
<span style="color: #f09383; font-weight: bold;">15</span>
<span style="color: #f09383; font-weight: bold;">2</span>
<span style="color: #f09383; font-weight: bold;">30</span>
$ sort -n file-o-numbers
<span style="color: #f09383; font-weight: bold;">1</span>
<span style="color: #f09383; font-weight: bold;">2</span>
<span style="color: #f09383; font-weight: bold;">15</span>
<span style="color: #f09383; font-weight: bold;">30</span>
</pre>
</div>
</section>
